import turtle as t
import math as m
import figures as fgr
t.speed(10)

#Ракета
# Корпус > окна > нос > хвост
rectangle(-500,-200,50,90,'#483D8B')
circle(-475, -147, 17, '#ADD8E6')
circle(-475, -197, 17, '#ADD8E6')
triangle_90(-475,-100,75,26,'#800000')
triangle_90(-475,-100,26,75,'#800000', -90)
triangle_90(-475,-100,75,15,'#FF0000')
triangle_90(-475,-100,15,75,'#FF0000', -90)
prlgrm(-450,-175,50,33, 45,'#808080', 90)
prlgrm(-525,-200,-50,-33, -45,'#808080', -90)

#Собака
#
prlgrm(-200,-150, 75,50, 64,'#A0522D')
triangle_90(-100,-200,25,50,'BLACK',-90)
triangle_90(-100,-150,28,53,'#8B4513',-90)
triangle_90(-100,-150,-28,-53,'#8B4513',90)
triangle_90(-175,-100,m.sqrt(100*100+50*50), m.sqrt(25*25+50*50), '#8B4513', -(180-90+64))
triangle_90(-225,-200,25,25,'BLACK',-90)
square(-237.5,-75,35,'#A0522D')
triangle_90(-237.5,-50,50,25,'#8B4513')
triangle_90(-237.5,-50,45,20,'#BC8F8F')
rectangle(-280, -66, 280-237.5,20,'#8B4513')
triangle_90(-280,-43,25,25,'BLACK',-180)
triangle_90(-100,-50,50,50,'#A0522D', 90)
t.done()

